# Reference Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
Face..::..Reference Property
Face Class See Also
---
Returns a stable reference to the face.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public Reference Reference { get; }
```

Visual Basic
---
```text
Public ReadOnly Property Reference As Reference
	Get
```

Visual C++
---
```text
public:
property Reference^ Reference {
	Reference^ get ();
}
```

# ### Field Value
This value may be if the object does not store a corresponding reference. This might be due to any of the following reasons:
  * The face was obtained from an API member which does not permit options to generate corresponding References (most API members, besides Element.Geometry, do not have an option to generate a Reference).
  * The corresponding geometry object does not permit referencing.

# See Also
Face Class
Autodesk.Revit.DB Namespace